Revit 2016 API
LoadCombination.UsageName Property
Returns usage value.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetUsageIds() method instead.")]
public string this[
	int index
] { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetUsageIds() method instead.")> _
Public ReadOnly Property UsageName ( _
	index As Integer _
) As String
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016. Use GetUsageIds() method instead.")]
public:
property String^ UsageName[int index] {
	String^ get (int index);
}
Parameters
index
Type: System.Int32
The index of usage in load combination.
Remarks
The index should be not less 0 and be less than load factors count.
See Also
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace